# IT Support & Development.
# Copyright (c) 2025, Studio Family Karaoke.
# All rights reserved.
#

# Function convert characters.
CC() {
    sed -E \
        -e 's/À|Á|Â|Ã|Ä|Å|Ǻ|Ā|Ă|Ą|Ǎ/A/g' \
        -e 's/à|á|â|ã|ä|å|ǻ|ā|ă|ą|ǎ|ª/a/g' \
        -e 's/ᴮ|Ḃ|Ḅ|Ḇ|ℬ|Ⓑ/B/g' \
        -e 's/ᵇ|ḃ|ḅ|ḇ|⒝|ⓑ/b/g' \
        -e 's/Ç|Ć|Ĉ|Ċ|Č/C/g' \
        -e 's/ç|ć|ĉ|ċ|č/x/g' \
        -e 's/Ð|Ď|Đ/D/g' \
        -e 's/ð|ď|đ/d/g' \
        -e 's/È|É|Ê|Ë|Ē|Ĕ|Ė|Ę|Ě/E/g' \
        -e 's/è|é|ê|ë|ē|ĕ|ė|ę|ě/e/g' \
        -e 's/Ḟ/F/g' \
        -e 's/ḟ/f/g' \
        -e 's/Ĝ|Ğ|Ġ|Ģ/G/g' \
        -e 's/ĝ|ğ|ġ|ģ/g/g' \
        -e 's/Ĥ|Ħ/H/g' \
        -e 's/ĥ|ħ/h/g' \
        -e 's/Ì|Í|Î|Ï|Ĩ|Ī|Ĭ|Ǐ|Į|İ/I/g' \
        -e 's/ì|í|î|ï|ĩ|ī|ĭ|ǐ|į|ı/i/g' \
        -e 's/Ĵ/J/g' \
        -e 's/ĵ/j/g' \
        -e 's/Ķ|Ǩ|ᴷ|Ḱ|Ḳ|Ḵ/K/g' \
        -e 's/ķ|ǩ|ᵏ|ḱ|ḳ|ḵ/k/g' \
        -e 's/Ĺ|Ļ|Ľ|Ŀ|Ł/L/g' \
        -e 's/ĺ|ļ|ľ|ŀ|ł/l/g' \
        -e 's/Ñ|Ń|Ņ|Ň/N/g' \
        -e 's/ñ|ń|ņ|ň|ŉ/n/g' \
        -e 's/Ò|Ó|Ô|Õ|Ō|Ŏ|Ǒ|Ő|Ơ|Ø|Ǿ|Ö/O/g' \
        -e 's/ò|ó|ô|õ|ō|ŏ|ǒ|ő|ơ|ø|ǿ|º/o/g' \
        -e 's/Ṕ|Ṗ/P/g' \
        -e 's/ṕ|ṗ/p/g' \
        -e 's/Ŕ|Ŗ|Ř|Ȑ|Ȓ|ᴿ/R/g' \
        -e 's/ŕ|ŗ|ř|ȑ|ȓ|ʳ/r/g' \
        -e 's/Ś|Ŝ|Ş|Š|Ș|Ṡ/S/g' \
        -e 's/ś|ŝ|ş|š|ș/s/g' \
        -e 's/Ţ|Ť|Ț|ᵀ|Ṫ|Ṭ/T/g' \
        -e 's/ţ|ť|ț|ᵗ|ṫ|ṭ/t/g' \
        -e 's/Ù|Ú|Û|Ũ|Ū|Ŭ|Ů|Ű|Ų|Ư|Ǔ|Ǖ|Ǘ|Ǚ|Ǜ/U/g' \
        -e 's/ù|ú|û|ũ|ū|ŭ|ů|ű|ų|ư|ǔ|ǖ|ǘ|ǚ|ǜ/u/g' \
        -e 's/Ŵ|ᵂ|Ẁ|Ẃ|Ẅ|Ẇ/W/g' \
        -e 's/ŵ|ʷ|ẁ|ẃ|ẅ|ẇ/w/g' \
        -e 's/Ý|Ŷ|Ÿ|Ȳ|Ẏ|Ỳ/Y/g' \
        -e 's/ý|ÿ|ŷ|ȳ|ʸ|ẏ/y/g' \
        -e 's/Ź|Ż|Ž|Ẑ|Ẓ/Z/g' \
        -e 's/ź|ż|ž|ᶻ/z/g' \
        -e 's/ᐸ|ᐹ|ᐹ|ᑄ|ᑅ|ᑆ|ᑇ|ᑈ|ᑉ/</g' \
        -e 's/ᐳ|ᐴ|ᐵ|ᐶ|ᐷ|ᑀ|ᑁ|ᑂ|ᑃ/>/g' \
        -e 's/([0-9A-Za-z])-([0-9A-Za-z])-([0-9A-Za-z])/\1_\2_\3/g' \
        -e 's/([0-9A-Za-z])-([0-9A-Za-z])?/\1_\2/g' \
        -e 's/([0-9A-Za-z])?-([0-9A-Za-z])/\1_\2/g' \
        -e 's/[/]{2}/\________/g' \
        -e 's/[/]{1}/\__/g' \
        -e 's/\:/\___/g' \
        -e 's/\?/____/g' \
        -e 's/\"/\_____/g' \
        -e 's/\“/\_____/g' \
        -e 's/\”/\_____/g' \
        -e 's/\*/\______/g' \
        -e 's/\;/\_______/g' \
        -e 's/…/.../g' \
        -e 's/\xC3\xB6/o/g' \
        -e 's/\xC3\xBC/u/g' \
        -e 's/\xCC\x88//g' \
        -e 's/\xE2\x80\x8B//g' \
        -e 's/\xE2\x80\x98/'\''/g' \
        -e 's/\xE2\x80\x99/'\''/g' \
        -e 's/‐/-/g' \
        -e 's/–/-/g' \
        -e 's/—/-/g'
}
